//
//  BAGridView_Version.h
//  BAGridView
//
//  Created by boai on 2017/12/23.
//  Copyright © 2017年 boai. All rights reserved.
//

#ifndef BAGridView_Version_h
#define BAGridView_Version_h


/*!
 *********************************************************************************
 ************************************ 更新说明 ************************************
 *********************************************************************************
 
 欢迎使用 BAHome 系列开源代码 ！
 如有更多需求，请前往：https://github.com/BAHome
 
 项目源码地址：
 OC 版 ：https://github.com/BAHome/BAGridView
 
 最新更新时间：2020-11-16 【倒叙】<br>
 最新Version：【Version：1.2.4】<br>
 更新内容：<br>
 1.2.4.1 新增自定义横向滚动排列样式！

 最新更新时间：2020-07-30 【倒叙】<br>
 最新Version：【Version：1.2.2】<br>
 更新内容：<br>
 1.2.2.1、 新增背景图片填充模式！详见：code <br>
 
 最新更新时间：2020-05-13 【倒叙】<br>
 最新Version：【Version：1.2.1】<br>
 更新内容：<br>
 1.2.1.1、修复 scrollEnabled 无效的问题！详见：code <br>
 
 最新更新时间：2020-04-15 【倒叙】<br>
 最新Version：【Version：1.2.0】<br>
 更新内容：<br>
 1.2.0.1、新增 图片的填充样式！详见：code <br>
 
 最新更新时间：2020-04-09 【倒叙】<br>
 最新Version：【Version：1.1.9】<br>
 更新内容：<br>
 1.1.9.1、新增 图片的圆角设置！详见：code <br>

 最新更新时间：2020-03-21 【倒叙】<br>
 最新Version：【Version：1.1.7】<br>
 更新内容：<br>
 1.1.7.1、修复 角标第一次隐藏后刷新数据无法再次显示的entity！详见：code <br>
 
 最新更新时间：2020-03-14 【倒叙】<br>
 最新Version：【Version：1.1.6】<br>
 更新内容：<br>
 1.1.6.1、新增自定义 badge，可以实现自定义 badge 样式、字体、字体颜色、背景颜色、圆角、offset等，满足大部分用户的角标需求！详见：code <br>
 
 最新更新时间：2019-10-09 【倒叙】<br>
 最新Version：【Version：1.1.5】<br>
 更新内容：<br>
 1.1.5.1、新增自定义图片的宽高！详见：demo <br>
 1.1.5.2、新增自定义背景图片！详见：demo <br>

 最新更新时间：2019-09-10 【倒叙】<br>
 最新Version：【Version：1.1.4】<br>
 更新内容：<br>
 1.1.4.1、优化部分代码，公开属性 `config`，新增 刷新操作示例！详见：demo <br>
 1.1.4.1、优化部分代码，优化默认不设置 itemWidth 时的自适应宽度设置，详见：demo <br>
 
 最新更新时间：2018-05-31 【倒叙】<br>
 最新Version：【Version：1.1.3】<br>
 更新内容：<br>
 1.1.3.1、优化部分代码，新增 是否可以滑动属性【scrollEnabled】！详见：demo <br>
 
 最新更新时间：2018-05-29 【倒叙】<br>
 最新Version：【Version：1.1.1】<br>
 更新内容：<br>
 1.1.1.1、优化部分代码，新增背景图片设置！详见：demo <br>
 
 最新更新时间：2018-05-28 【倒叙】<br>
 最新Version：【Version：1.1.0】<br>
 更新内容：<br>
 1.1.0.1、全新版本适配【Version：1.1.0】，适配更加简洁！详见：demo <br>
 1.1.0.2、原 配置方法 单独抽成 BAGridView_Config 类，所有的配置都可以单独设置！更加简洁明了！如果代码中有使用老版本的，可以更改适配，也可以选择锁定上一版本【1.0.7】 <br>
 
 最新更新时间：2017-12-23 【倒叙】<br>
 最新Version：【Version：1.0.7】<br>
 更新内容：<br>
 1.0.7.1、新增图文样式下文字 title 内容可以显示最多两行！详见：demo 1<br>
 1.0.7.2、新增 BAGridView_Version.h 类，版本更新分离更易读！<br>

 最新更新时间：2017-07-07 【倒叙】<br>
 最新Version：【Version：1.0.6】<br>
 更新内容：<br>
 1.0.6.1、新增网络图片、placdholderImage功能（感谢群里 [@武汉-马阿飞](http://www.jianshu.com/u/7f8b1720f857) 同学提出的 需求！）<br>
 
 最新更新时间：2017-06-23 【倒叙】<br>
 最新Version：【Version：1.0.5】<br>
 更新内容：<br>
 1.0.5.1、优化部分宏定义<br>
 
 最新更新时间：2017-06-23 【倒叙】<br>
 最新Version：【Version：1.0.4】<br>
 更新内容：<br>
 1.0.4.1、优化部分宏定义<br>
 
 最新更新时间：2017-06-23 【倒叙】<br>
 最新Version：【Version：1.0.3】<br>
 更新内容：<br>
 1.0.3.1、新增 支持 自定义 item 选中改变颜色后自动还原背景颜色（感谢群里 [@武汉-马阿飞](http://www.jianshu.com/u/7f8b1720f857) 同学提出的 需求！）<br>
 
 最新更新时间：2017-06-21 【倒叙】<br>
 最新Version：【Version：1.0.2】<br>
 更新内容：<br>
 1.0.2.1、新增 支持 自定义 item 背景颜色 和 选中背景颜色（感谢群里 [@武汉-马阿飞](http://www.jianshu.com/u/7f8b1720f857) 同学提出的 需求！）<br>
 
 最新更新时间：2017-06-21 【倒叙】<br>
 最新Version：【Version：1.0.1】<br>
 更新内容：<br>
 1.0.1.1、新增 支持 自定义 图片文字间距功能（感谢群里 [@武汉-马阿飞](http://www.jianshu.com/u/7f8b1720f857) 同学提出的 需求！）<br>
 1.0.1.2、新增 自定义 所有文字字体（感谢群里 [@武汉-马阿飞](http://www.jianshu.com/u/7f8b1720f857) 同学提出的 需求！）<br>
 
 最新更新时间：2017-06-20 【倒叙】<br>
 最新Version：【Version：1.0.0】<br>
 更新内容：<br>
 1.0.0.1、支付宝首页 九宫格 布局封装<br>
 1.0.0.2、自适应按钮位置和数量<br>
 1.0.0.3、自定义文字图片 或者 两行文字样式<br>
 1.0.0.4、自定义分割线：显示/隐藏<br>
 1.0.0.5、自定义分割线：颜色<br>
 
 */

#endif /* BAGridView_Version_h */
